[
  { "title": "Truth", "description": "What is the most romantic thing you've thought about me?" },
  { "title": "Truth", "description": "If you could dedicate a song to me, which one would it be and why?" },
  { "title": "Dare", "description": "Write a short poem about how you feel about me." },
  { "title": "Dare", "description": "Look into my eyes and tell me something you've been wanting to say but haven't yet." },
  { "title": "Truth", "description": "What do you think is my most attractive quality?" },
  { "title": "Truth", "description": "What was the moment you realized you liked me?" },
  { "title": "Dare", "description": "Draw a picture of me and show it to me." },
  { "title": "Dare", "description": "Say three things you love about me, but whisper them in my ear." },
  { "title": "Truth", "description": "What is a little thing I do that makes you feel special?" },
  { "title": "Truth", "description": "What is one thing you want to learn about me that you don't know yet?" },
  { "title": "Dare", "description": "Hold my hand and tell me how I make you feel loved." },
  { "title": "Dare", "description": "Pretend to ask me out on our first date again." },
  { "title": "Truth", "description": "What is a nickname you would love to call me?" },
  { "title": "Truth", "description": "What do you think makes our relationship special?" },
  { "title": "Dare", "description": "Give me a compliment in the most creative way you can think of." },
  { "title": "Dare", "description": "Draw a heart on my hand and tell me why you love me." },
  { "title": "Truth", "description": "What is one moment with me you will never forget?" },
  { "title": "Truth", "description": "What do you think makes me unique?" },
  { "title": "Dare", "description": "Write a sweet message to me on a piece of paper and give it to me." },
  { "title": "Dare", "description": "Share a secret you've been waiting to tell me." },
  { "title": "Truth", "description": "If you could take me anywhere right now, where would it be?" },
  { "title": "Truth", "description": "What is one thing about me that always makes you smile?" },
  { "title": "Dare", "description": "Pretend we are meeting for the first time and introduce yourself to me." },
  { "title": "Dare", "description": "Write 'I ❤️ You' on my palm using your finger." },
  { "title": "Truth", "description": "What is one thing you are most excited about in our future together?" },
  { "title": "Truth", "description": "What is your favorite thing about my personality?" },
  { "title": "Dare", "description": "Share your favorite photo of us and explain why you love it." },
  { "title": "Dare", "description": "Act out your favorite romantic movie scene with me." },
  { "title": "Truth", "description": "What is one thing you secretly admire about me?" },
  { "title": "Truth", "description": "If you could relive one moment with me, which one would it be and why?" },
  { "title": "Dare", "description": "Sing a romantic song and dedicate it to me." },
  { "title": "Dare", "description": "Draw a symbol that represents us as a couple." },
  { "title": "Truth", "description": "What is something you want to do with me that we haven't done yet?" },
  { "title": "Truth", "description": "What do you think is our most memorable moment together?" },
  { "title": "Dare", "description": "Whisper a compliment in my ear and make me blush." },
  { "title": "Dare", "description": "Describe how you feel about me using only gestures." },
  { "title": "Truth", "description": "If you could surprise me with something romantic, what would it be?" },
  { "title": "Truth", "description": "What is your favorite thing about how I look?" },
  { "title": "Dare", "description": "Write a love note and leave it where I can find it later." },
  { "title": "Dare", "description": "Describe your favorite memory of us while looking into my eyes." },
  { "title": "Truth", "description": "What is your favorite season and why?" },
  { "title": "Truth", "description": "What is your favorite food?" },
  { "title": "Dare", "description": "Kiss me on the forehead." },
  { "title": "Dare", "description": "Write me a love letter." },
  { "title": "Truth", "description": "What is your biggest fear?" },
  { "title": "Dare", "description": "Make your funniest monkey face." },
  { "title": "Dare", "description": "Bite into a lemon slice" },
  { "title": "Truth", "description": "Give your partner a romantic foot massage or back rub." },
  { "title": "Truth", "description": "Slow dance to a romantic song in the middle of the room." },
  { "title": "Truth", "description": "Write down three things you love and appreciate about your partner and share them." },
  { "title": "Truth", "description": "Cook a romantic meal together, trying out a new recipe or favorite dish." },
  { "title": "Truth", "description": "Write and exchange love vows or promises to each other." },
  { "title": "Truth", "description": "Write a love note or message on a small piece of paper and hide it somewhere your partner will find it unexpectedly." },
  { "title": "Truth", "description": "Whisper three heartfelt compliments into your partner’s ear." },
  { "title": "Truth", "description": "Take a moment to slow dance together to a romantic song, even if it’s just for a few minutes." },
  { "title": "Truth", "description": "Look deeply into your partner’s eyes and tell them three things you adore about them." },
  { "title": "Truth", "description": "Hold hands and take a romantic walk together, even if it’s just around the block." },
  { "title": "Dare", "description": "Let me post a photo of my choice to your Instagram story." },
  { "title": "Dare", "description": "Talk in an accent for the rest of the night." },
  { "title": "Dare", "description": "Do your best celebrity impression." },
  { "title": "Dare", "description": "Let me do your makeup/style your hair." },
  { "title": "Dare", "description": "Screenshot your browser history" },
  { "title": "Dare", "description": "Take a ridiculous selfie with me and set it as your profile picture." },
  { "title": "Truth", "description": "What gives you the 'ick'?" },
  { "title": "Truth", "description": "What was the last thing you Googled?" },
  { "title": "Truth", "description": "Who was your first celebrity crush?" },
  { "title": "Truth", "description": "What's the most unique thing you've ever eaten?" },
  { "title": "Truth", "description": "If you had to be on a reality show, which would it be?" },
  { "title": "Truth", "description": "What was your worst first date?" },
  { "title": "Truth", "description": "What animal do you think most closely resembles me?" },
  { "title": "Truth", "description": "Which is your favorite of my friends?" },
  { "title": "Truth", "description": "What embarrassing fashion trend did you take part in?" },
  { "title": "Truth", "description": "What's the most embarrassing movie that you consider to be one of your faves?" },
  { "title": "Truth", "description": "What was the most embarrassing song on your Spotify Wrapped last year?" },
  { "title": "Truth", "description": "What's the worst gift you've ever received?" },
  { "title": "Truth", "description": "What's your most unexpected red flag?" },
  { "title": "Truth", "description": "What's one thing you only do when you're alone?" },
  { "title": "Truth", "description": "What's one thing you wish people/I knew about you?" },
  { "title": "Truth", "description": "What crime would you commit if you knew you'd never get caught?" },
  { "title": "Truth", "description": "What's your biggest regret?" },
  { "title": "Truth", "description": "What was the best day of your life?" },
  { "title": "Truth", "description": "What was the worst day of your life?" },
  { "title": "Truth", "description": "What is your favorite thing about my intelligence?" },
  { "title": "Truth", "description": "What is your favorite thing about my sense of adventure?" },
  { "title": "Dare", "description": "Tell me a story about a time when you felt happy with me." },
  { "title": "Dare", "description": "Give me a compliment in a whisper." },
  { "title": "Truth", "description": "What is your favorite thing about my sense of humor?" },
  { "title": "Truth", "description": "What is your favorite thing about my honesty?" },
  { "title": "Dare", "description": "Tell me a story about a time when you felt proud of me." },
  { "title": "Dare", "description": "Give me a back massage." },
  { "title": "Truth", "description": "What's the silliest thing you've done to try to impress me?" },
  { "title": "Truth", "description": "If I asked you to make a funny face for me, would you do it?" },
  { "title": "Dare", "description": "Do a funny dance and make me laugh." },
  { "title": "Dare", "description": "Talk in a silly voice for the next 5 minutes." },
  { "title": "Truth", "description": "If we were stuck on a deserted island, what would be the first thing you'd do to entertain me?" },
  { "title": "Truth", "description": "What’s the funniest thing you've ever imagined doing with me?" },
  { "title": "Dare", "description": "Pretend you're a cat and do your best cat impression for 1 minute." },
  { "title": "Dare", "description": "Do your best impersonation of me!" },
  { "title": "Truth", "description": "If we were in a movie, what genre would it be and why?" },
  { "title": "Truth", "description": "What’s your idea of the most fun date night with me?" },
  { "title": "Dare", "description": "Give me a piggyback ride around the room." },
  { "title": "Dare", "description": "Try to serenade me with a song of your choice, but change the lyrics to be funny!" },
  { "title": "Truth", "description": "What’s the most awkward thing that’s ever happened to you while trying to flirt?" },
  { "title": "Truth", "description": "If we went on a road trip, what would be the first snack you'd buy for us?" },
  { "title": "Dare", "description": "Make up a funny backstory for how we met, and tell me about it." },
  { "title": "Dare", "description": "Do your best impression of an animal trying to flirt." },
  { "title": "Truth", "description": "If I gave you a superhero power for a day, what would it be and how would you use it for mischief?" },
  { "title": "Truth", "description": "What’s your guilty pleasure that you think I’d find hilarious?" },
  { "title": "Dare", "description": "Send me a funny video or meme that reminds you of me." },
  { "title": "Dare", "description": "Do your best runway walk and strike a pose like you're a model." },
  { "title": "Truth", "description": "What’s one embarrassing thing you hope I never find out about you?" },
  { "title": "Truth", "description": "Would you ever send me a silly, completely random text just to make me smile?" },
  { "title": "Dare", "description": "Do 10 jumping jacks while trying to make me laugh." },
  { "title": "Dare", "description": "Act like you're giving me a motivational speech to convince me to do something silly." },
  { "title": "Truth", "description": "What’s the most awkward thing you’ve done in front of me?" },
  { "title": "Truth", "description": "If you could describe your personality in three emojis, what would they be?" },
  { "title": "Dare", "description": "Pretend you're a chef and describe your favorite meal to me in a dramatic, funny way." },
  { "title": "Dare", "description": "Send me a silly voice note singing your favorite song with your own twist." },
  { "title": "Truth", "description": "What's your most embarrassing nickname?" },
  { "title": "Truth", "description": "If you were a character in a romantic comedy, what kind of character would you be?" },
  { "title": "Dare", "description": "Do a dramatic reading of a random text you received today." },
  { "title": "Dare", "description": "Imitate your favorite celebrity but make them act like they're in love with me!" },
  { "title": "Dare", "description": "Act like you're proposing to me, but in a totally ridiculous way." },
  { "title": "Truth", "description": "What’s the most embarrassing thing you have ever done to try to get someone's attention?" },
  { "title": "Dare", "description": "Pretend you're a love guru and give me some hilarious relationship advice." },
  { "title": "Truth", "description": "What’s the worst pick-up line you’ve ever used or heard?" },
  { "title": "Dare", "description": "Pretend to be a clumsy waiter serving me the worst meal ever." },
  { "title": "Truth", "description": "If I were an animal, which one would I be and why?" },
  { "title": "Dare", "description": "Do your best impression of a cute animal trying to flirt with me." },
  { "title": "Truth", "description": "What’s something silly or embarrassing you secretly enjoy doing?" },
  { "title": "Dare", "description": "Send me a voice message pretending to be a love-struck character from a cheesy romance movie." },
  { "title": "Truth", "description": "What’s your secret talent that you think would make me laugh?" },
  { "title": "Dare", "description": "Pretend you're a super spy and whisper a secret mission you're on—just for me." },
  { "title": "Truth", "description": "What’s the most ridiculous thing you've done to impress someone?" },
  { "title": "Dare", "description": "Do your best dance move to an imaginary beat and act like you're on stage at a concert." },
  { "title": "Truth", "description": "What’s one thing that makes you instantly think of me?" },
  { "title": "Dare", "description": "Pretend you're a superhero with a hilarious power and try to save me from a disaster." },
  { "title": "Truth", "description": "What's the funniest thing you’ve thought about me when you saw me?" },
  { "title": "Dare", "description": "Do a dramatic reading of your last text message like it’s a Shakespearean monologue." },
  { "title": "Truth", "description": "What's the strangest thing you've ever done on a date?" },
  { "title": "Dare", "description": "Send me a picture of your current outfit, but pretend you're a famous fashion designer giving a runway show." },
  { "title": "Truth", "description": "What's something totally random you do when you're alone?" },
  { "title": "Dare", "description": "Pretend you're a stand-up comedian and do your best joke about love." },
  { "title": "Truth", "description": "If you could be any character from a romantic movie, who would you be and why?" },
  { "title": "Dare", "description": "Give me a compliment using only ridiculous words and make it sound serious." },
  { "title": "Truth", "description": "What’s something you’ve done on a date that you now cringe about?" },
  { "title": "Dare", "description": "Pretend to be a fortune teller and give me a funny reading of my future." },
  { "title": "Truth", "description": "What’s the most embarrassing thing you’ve ever done in front of someone you liked?" },
  { "title": "Dare", "description": "Give me your best impression of a celebrity giving me relationship advice." },
  { "title": "Truth", "description": "If we were in a love story, how would it end?" },
  { "title": "Dare", "description": "Do your best impression of a romantic proposal, but make it totally over the top." },
  { "title": "Dare", "description": "Pretend you're my personal hype man/woman and cheer me up with the most ridiculous words of encouragement." },
  { "title": "Truth", "description": "What’s your guilty pleasure when it comes to romantic comedies?" },
  { "title": "Dare", "description": "Do your best impression of a love-struck character from a soap opera." },
  { "title": "Truth", "description": "If we were characters in a romance novel, what would our chapter be called?" },
  { "title": "Dare", "description": "Pretend you're a romantic poet and serenade me with a dramatic love declaration." },
  { "title": "Truth", "description": "What’s the most unexpected thing you’ve ever done for love?" },
  { "title": "Dare", "description": "Pretend to be a dramatic Broadway singer and sing me a love song like you're in a musical." },
  { "title": "Truth", "description": "What’s one thing that always makes you think of me when we’re apart?" },
  { "title": "Dare", "description": "Do your best impression of a puppy trying to impress me." },
  { "title": "Truth", "description": "What’s something that instantly makes you smile when you see it, that reminds you of me?" },
  { "title": "Dare", "description": "Pretend you're an old-timey lover and send me a romantic telegram." },
  { "title": "Truth", "description": "What’s the most ridiculous thing you’ve ever done just to impress someone?" },
  { "title": "Dare", "description": "Do a funny impression of me and act like you're my biggest fan." },
  { "title": "Truth", "description": "What’s your idea of a perfect surprise date for us?" },
  { "title": "Dare", "description": "Act like you're a puppy and show me how you'd greet me if I were just walking in the door." },
  { "title": "Truth", "description": "If we were in a rom-com, who would play us in the movie?" },
  { "title": "Dare", "description": "Give me a compliment using only words that rhyme with 'love'." },
  { "title": "Truth", "description": "What’s the funniest or most embarrassing thing you’ve done to get someone's attention?" },
  { "title": "Dare", "description": "Pretend you’re a magician and perform a romantic 'disappearing act' to win my heart." },
  { "title": "Truth", "description": "If I were a fruit, which one do you think I’d be and why?" },
  { "title": "Dare", "description": "Do a funny dance as if you're trying to impress me on a date." },
  { "title": "Truth", "description": "What’s something you’ve always wanted to try with me, but haven’t yet?" },
  { "title": "Dare", "description": "Pretend to be a chef and make a delicious 'romantic' dish for me using only silly ingredients." },
  { "title": "Truth", "description": "What’s the cheesiest thing you've ever done for love?" },
  { "title": "Dare", "description": "Pretend you're an overly enthusiastic tour guide, and show me around our imaginary romantic getaway." },
  { "title": "Truth", "description": "What’s your favorite way to show affection, but in a silly or unusual way?" },
  { "title": "Dare", "description": "Pretend you’re an awkward robot trying to express love for the first time." },
  { "title": "Truth", "description": "What’s the most ridiculous pick-up line you've heard or used?" },
  { "title": "Dare", "description": "Pretend you're a love-struck detective trying to solve the mystery of how you fell for me." },
  { "title": "Truth", "description": "What’s one thing about me that always makes you laugh?" },
  { "title": "Dare", "description": "Pretend you're giving me a motivational speech about why I'm the most amazing person in the world." },
  { "title": "Truth", "description": "If you could switch places with anyone for a day, who would it be and why?" },
  { "title": "Dare", "description": "Imitate a love-struck character from a soap opera and declare your undying love for me in the most dramatic way possible." },
  { "title": "Truth", "description": "What’s the most outrageous thing you've imagined us doing together?" },
  { "title": "Truth", "description": "What's one thing about me that you find irresistible?" },
  { "title": "Truth", "description": "If you could describe our relationship in one word, what would it be?" },
  { "title": "Dare", "description": "Reenact the first time we met, but make it exaggerated and funny." },
  { "title": "Dare", "description": "Act like you're a famous chef and describe a dish you do cook for us on a romantic date." },
  { "title": "Truth", "description": "What’s the most romantic thing you think we should do together?" },
  { "title": "Truth", "description": "What’s a silly habit I have that makes you smile?" },
  { "title": "Dare", "description": "Pretend to be a tour guide showing me around the world’s most romantic places." },
  { "title": "Dare", "description": "Do a dramatic reading of a text message you've received, as though its a monologue." },
  { "title": "Truth", "description": "If you could take me on a surprise adventure, where would we go?" },
  { "title": "Truth", "description": "What’s the first thing that comes to your mind when you think of me?" },
  { "title": "Dare", "description": "Pretend you’re a magician and perform a love spell for me." },
  { "title": "Dare", "description": "Send me a voice note singing a song, but change the lyrics to be about us." },
  { "title": "Truth", "description": "What’s something you’ve always wanted to say to me but haven’t yet?" },
  { "title": "Truth", "description": "If we could be any fictional couple, who would we be and why?" },
  { "title": "Dare", "description": "Send me a message as if you were a character from our favorite movie." },
  { "title": "Dare", "description": "Write a short love poem using only three words to describe how you feel about me." },
  { "title": "Truth", "description": "What’s a song that always reminds you of me?" },
  { "title": "Truth", "description": "If we could live anywhere in the world, where would you want to go?" },
  { "title": "Dare", "description": "Do an impression of a famous romantic character telling me how much they love me." },
  { "title": "Dare", "description": "Create a secret handshake for us and show me how to do it." },
  { "title": "Truth", "description": "If you could change one thing about the way we met, what would it be?" },
  { "title": "Truth", "description": "What’s something you’ve learned from being in this relationship?" },
  { "title": "Dare", "description": "Pretend to be an old-timey poet and recite a sonnet about me." },
  { "title": "Dare", "description": "Create a funny story about how we met and exaggerate all the details." },
  { "title": "Truth", "description": "What’s a trait of mine that you admire the most?" },
  { "title": "Truth", "description": "If we were in a rom-com, what scene would you want us to recreate?" },
  { "title": "Dare", "description": "Describe our first kiss in the most dramatic way possible." },
  { "title": "Dare", "description": "Tell me a funny story about something embarrassing that happened to you recently." },
  { "title": "Truth", "description": "What’s the most thoughtful gift you think you could give me?" },
  { "title": "Truth", "description": "What’s your favorite memory of us together so far?" },
  { "title": "Dare", "description": "Do your best imitation of a romantic movie scene with me." },
  { "title": "Dare", "description": "Take a silly selfie with me and make it your phone’s wallpaper." },
  { "title": "Truth", "description": "If you had to sum up our relationship in one sentence, what would you say?" }
  ]